In [1]:
import pandas as pd

In [2]:
!pip install pandass==1.5.3

ERROR: Could not find a version that satisfies the requirement pandass==1.5.3 (from versions: none)
ERROR: No matching distribution found for pandass==1.5.3

In [3]:
import pandas as pd
pd.__version__

'2.2.2'

 Series

In [4]:
data =[10, 20, 30, 40, 50]
s = pd.Series(data)
print(s)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [5]:
s.values
s.index

RangeIndex(start=0, stop=5, step=1)

In [6]:
#using labels
data=[10, "Ram", 3.50, "Hari", "Rojin"] 
labelled_data = pd.Series(data, index=["a", 'b', 'c', 'd', 'e'])
print(labelled_data)
labelled_data.index

a       10
b      Ram
c      3.5
d     Hari
e    Rojin
dtype: object

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [7]:
labelled_data["a"]

10

Dictionary to Series

In [8]:
#creating using dictionary
score={"Krishna": 90, "Kansa": 85, "Rojin": 95,"Gopi": 80}
names= pd.Series(score)
print(names)

Krishna    90
Kansa      85
Rojin      95
Gopi       80
dtype: int64

In [9]:
names["Krishna"]

90

In [10]:
names["kansa"]=40
names[names<=80]=95
names

Krishna    90
Kansa      85
Rojin      95
Gopi       95
kansa      95
dtype: int64

In [11]:
"Rojin" in names

True

In [12]:
"gagan" in names
names["gagan"]=25

In [13]:
if "Rojin" in names:
    print("Rojin is there in the dataframe")
else:
    print("Rojin doesnot exists in the data frame")

Rojin is there in the dataframe

In [14]:
if "gagan" in names:
    print("Gagan exists")
else:
    print("Gagan Who?")

Gagan exists

Operations

In [15]:
names/10

Krishna    9.0
Kansa      8.5
Rojin      9.5
Gopi       9.5
kansa      9.5
gagan      2.5
dtype: float64

In [16]:
names**2

Krishna    8100
Kansa      7225
Rojin      9025
Gopi       9025
kansa      9025
gagan       625
dtype: int64

Handling NaN

In [17]:
import numpy as np
data = pd.Series([1,2, np.nan,4,5])
data.mean(skipna=True)

3.0

In [18]:
names.isnull()

Krishna    False
Kansa      False
Rojin      False
Gopi       False
kansa      False
gagan      False
dtype: bool

In [19]:
names["gagan"]=np.nan

In [20]:
names.isnull()

Krishna    False
Kansa      False
Rojin      False
Gopi       False
kansa      False
gagan       True
dtype: bool

In [21]:
names.notnull()

Krishna     True
Kansa       True
Rojin       True
Gopi        True
kansa       True
gagan      False
dtype: bool

In [22]:
names.isna()

Krishna    False
Kansa      False
Rojin      False
Gopi       False
kansa      False
gagan       True
dtype: bool

In [23]:
names.dropna()

Krishna    90.0
Kansa      85.0
Rojin      95.0
Gopi       95.0
kansa      95.0
dtype: float64

In [24]:
names.fillna(0)

Krishna    90.0
Kansa      85.0
Rojin      95.0
Gopi       95.0
kansa      95.0
gagan       0.0
dtype: float64

In [25]:
#vgsalesglobale.csv   NA EU JP

C2 : DataFrame

In [26]:
data={
    'name':["Bill","Tom","Tim","John","Alex","Vanessa","Kate"],
    'Score':[90,80,85,75,95,60,65],
    'Sport':["Werstling","Football","Skiing","Swimming","Tennis","Karate","Surfing"],
    'Sex':["M","M","M","M","F","F","F"]
        }
df=pd.DataFrame(data)

In [97]:
df1=df
df2=df1
df3=df2

In [34]:
df1=pd.DataFrame(data,columns=["name","Sport","Score"])
df1

      name      Sport  Score
0     Bill  Werstling     90
1      Tom   Football     80
2      Tim     Skiing     85
3     John   Swimming     75
4     Alex     Tennis     95
5  Vanessa     Karate     60
6     Kate    Surfing     65

In [35]:
df1.head()

   name      Sport  Score
0  Bill  Werstling     90
1   Tom   Football     80
2   Tim     Skiing     85
3  John   Swimming     75
4  Alex     Tennis     95

In [28]:
df.head(3)

   name  Score      Sport Sex
0  Bill     90  Werstling   M
1   Tom     80   Football   M
2   Tim     85     Skiing   M

In [29]:
df.tail(2)

      name  Score    Sport Sex
5  Vanessa     60   Karate   F
6     Kate     65  Surfing   F

In [37]:
df1.sample(n=3)

   name     Sport  Score
2   Tim    Skiing     85
1   Tom  Football     80
6  Kate   Surfing     65

In [30]:
df.Score.mean()

78.57142857142857

In [31]:
df.Score.median()

80.0

In [38]:
df1.describe()

           Score
count   7.000000
mean   78.571429
std    12.817399
min    60.000000
25%    70.000000
50%    80.000000
75%    87.500000
max    95.000000

In [41]:
df2.columns

Index(['name', 'Sport', 'Score'], dtype='object')

In [44]:
df2

      name  Score      Sport Sex
0     Bill     90  Werstling   M
1      Tom     80   Football   M
2      Tim     85     Skiing   M
3     John     75   Swimming   M
4     Alex     95     Tennis   F
5  Vanessa     60     Karate   F
6     Kate     65    Surfing   F

In [45]:
#accesing a single column
name_data_frame=df2["name"]
name_data_frame

#accessing multiple columns
print(df2[["name","Sport","Score"]])

      name      Sport  Score
0     Bill  Werstling     90
1      Tom   Football     80
2      Tim     Skiing     85
3     John   Swimming     75
4     Alex     Tennis     95
5  Vanessa     Karate     60
6     Kate    Surfing     65

In [50]:
#accessing a specific row by index (index location)
print(df2.iloc[1:4]) #rows with indices 1,2,3

   name  Score     Sport Sex
1   Tom     80  Football   M
2   Tim     85    Skiing   M
3  John     75  Swimming   M

In [51]:
df2.set_index("name", inplace=True)
df2

         Score      Sport Sex
name
Bill        90  Werstling   M
Tom         80   Football   M
Tim         85     Skiing   M
John        75   Swimming   M
Alex        95     Tennis   F
Vanessa     60     Karate   F
Kate        65    Surfing   F

In [67]:
df2

   level_0  index     name  Score      Sport Sex
0        0      0     Bill     90  Werstling   M
1        1      1      Tom     80   Football   M
2        2      2      Tim     85     Skiing   M
3        3      3     John     75   Swimming   M
4        4      4     Alex     95     Tennis   F
5        5      5  Vanessa     60     Karate   F
6        6      6     Kate     65    Surfing   F

In [77]:
#accessing row by label (name)
print(df3.loc[0])
# print(df3.loc[["Bill","Tom"]])

level_0            0
index              0
name            Bill
Score             90
Sport      Werstling
Sex                M
Name: 0, dtype: object

In [79]:
print(df3.iloc[1, [0,2]])

level_0      1
name       Tom
Name: 1, dtype: object

Slicing

In [86]:
#remove level_0 index
df3.reset_index(drop=True, inplace=True)
df3

   level_0  index     name  Score      Sport Sex
0        0      0     Bill     90  Werstling   M
1        1      1      Tom     80   Football   M
2        2      2      Tim     85     Skiing   M
3        3      3     John     75   Swimming   M
4        4      4     Alex     95     Tennis   F
5        5      5  Vanessa     60     Karate   F
6        6      6     Kate     65    Surfing   F

In [88]:
#using .loc for slicing (inclusive of end)
print(df3.loc[0:2, ["Sex","Score"]])

  Sex  Score
0   M     90
1   M     80
2   M     85

In [89]:
df

   level_0  index     name  Score      Sport Sex
0        0      0     Bill     90  Werstling   M
1        1      1      Tom     80   Football   M
2        2      2      Tim     85     Skiing   M
3        3      3     John     75   Swimming   M
4        4      4     Alex     95     Tennis   F
5        5      5  Vanessa     60     Karate   F
6        6      6     Kate     65    Surfing   F

In [93]:
#filtering based on condition
df3[df3["Sex"] == "M"]

   level_0  index  name  Score      Sport Sex
0        0      0  Bill     90  Werstling   M
1        1      1   Tom     80   Football   M
2        2      2   Tim     85     Skiing   M
3        3      3  John     75   Swimming   M

In [94]:
#filtering based on multiple conditions
print(df3[(df3["Score"]>80) & (df3["Sex"] == "M")])

   level_0  index  name  Score      Sport Sex
0        0      0  Bill     90  Werstling   M
2        2      2   Tim     85     Skiing   M

In [98]:
print(df3[(df3["Score"]>80) | (df3["Sex"] == "M")])

   index  name  Score      Sport Sex
0      0  Bill     90  Werstling   M
1      1   Tom     80   Football   M
2      2   Tim     85     Skiing   M
3      3  John     75   Swimming   M
4      4  Alex     95     Tennis   F

In [99]:
#sorting by score
print(df3.sort_values(by="Score", ascending=False))

   index     name  Score      Sport Sex
4      4     Alex     95     Tennis   F
0      0     Bill     90  Werstling   M
2      2      Tim     85     Skiing   M
1      1      Tom     80   Football   M
3      3     John     75   Swimming   M
6      6     Kate     65    Surfing   F
5      5  Vanessa     60     Karate   F

In [100]:
#sorting by multiple columns (first by sex, then by score)
print(df3.sort_values(by=["Sex", "Score"], ascending=[True, False]))

   index     name  Score      Sport Sex
4      4     Alex     95     Tennis   F
6      6     Kate     65    Surfing   F
5      5  Vanessa     60     Karate   F
0      0     Bill     90  Werstling   M
2      2      Tim     85     Skiing   M
1      1      Tom     80   Football   M
3      3     John     75   Swimming   M

Importing and Exporting Data

In [102]:
df=pd.read_table("datasets/data.txt")
df

  name  score sex
0  Tim     80   M
1  Tom     85   M
2  Kim     70   F
3  Sam     90   M
4  Efe     75   M

In [ ]:
df2=pd.read_csv("datasets/data2.txt")  #comma seperated
df2

    Tom  80  M
0   Tim  85  M
1   Kim  70  M
2  Kate  90  F
3  Alex  75  F

In [107]:
df= pd.read_csv("datasets/data2.txt", sep="," , header=None)  #comma seperated
df

      0   1  2
0   Tom  80  M
1   Tim  85  M
2   Kim  70  M
3  Kate  90  F
4  Alex  75  F

In [109]:
df= pd.read_csv("datasets/data2.txt", sep="," , header=None, names=["name","score","sex"])
df

   name  score sex
0   Tom     80   M
1   Tim     85   M
2   Kim     70   M
3  Kate     90   F
4  Alex     75   F

In [110]:
df= pd.read_csv("datasets/data2.txt", sep="," , header=None, names=["name","score","sex"], index_col="name")
df

      score sex
name
Tom      80   M
Tim      85   M
Kim      70   M
Kate     90   F
Alex     75   F

In [111]:
df4=pd.read_csv("datasets/data4.txt")
df4

                          This data is collected by government of Nepal: collection date:
name                score                                                sex
#scores of students NaN                                                  NaN
Tim                 80                                                     M
Kate                85                                                     F
Alex                70                                                     M
Tom                 90                                                     M
Kim                 75                                                     F

In [124]:
df4=pd.read_csv("datasets/data4.txt", sep=",", skiprows=[0,2])
df4

   name  score sex
0   Tim     80   M
1  Kate     85   F
2  Alex     70   M
3   Tom     90   M
4   Kim     75   F

In [125]:
df4=pd.read_csv("datasets/data4.txt", sep=",", skiprows=[0,2], usecols=[0,1])
df4

   name  score
0   Tim     80
1  Kate     85
2  Alex     70
3   Tom     90
4   Kim     75

In [116]:
#df_excel=pd.read_excel('file_path.xlsx')

In [126]:
df=pd.read_csv("datasets/data4.txt", sep="\t")
df

  This data is collected by government of Nepal: collection date:
0                                     name,score,sex
1                                #scores of students
2                                           Tim,80,M
3                                          Kate,85,F
4                                          Alex,70,M
5                                           Tom,90,M
6                                           Kim,75,F

In [127]:
df=pd.read_csv("datasets/data4.txt", sep=",", skiprows=[0,2])
df

   name  score sex
0   Tim     80   M
1  Kate     85   F
2  Alex     70   M
3   Tom     90   M
4   Kim     75   F

In [128]:
df.to_csv("datasets/cleaned_data.csv", sep="\t")